#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Changes:
  + create
  # module.s3website["test.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
      + id   = (known after apply)
      + json = (known after apply)
      + statement {
          + actions   = [
              + "s3:GetObject",
          + resources = [
              + (known after apply),
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
              + variable = "AWS:SourceArn"
          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
              + type        = "Service"
  # module.s3website["test.davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz will be created
  + resource "aws_cloudfront_distribution" "davidbornitz" {
      + aliases                         = [
          + "test.davidbornitz.dev",
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
          + cached_methods         = [
              + "GET",
              + "HEAD",
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "test.davidbornitz.dev"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"
          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)
              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "test.davidbornitz.dev"
      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
  # module.s3website["test.davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz will be created
  + resource "aws_cloudfront_origin_access_control" "davidbornitz" {
      + description                       = "Allow Only Cloudfront"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = (known after apply)
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
  # module.s3website["test.davidbornitz.dev"].aws_route53_record.record will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "test.davidbornitz.dev"
      + type            = "A"
      + zone_id         = "Z04601461HBLV7APEL0VR"
      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
  # module.s3website["test.davidbornitz.dev"].aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
  # module.s3website["test.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
  # module.s3website["test.davidbornitz.dev"].aws_s3_bucket_website_configuration.website will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)
      + error_document {
          + key = "error.html"
      + index_document {
          + suffix = "index.html"
  # module.s3website["test.davidbornitz.dev"].random_id.bucket will be created
  + resource "random_id" "bucket" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
Plan: 7 to add, 0 to change, 0 to destroy.
─────────────────────────────────────────────────────────────────────────────
```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*